import numpy as np

m = 2 # кількість факторів
k = 6 # кількість функцій моделі регресії
n = 9 # кількість експериметів

X = [[-1, -1],
     [1, -1],
     [-1, 1],
     [1, 1],
     [0, 0],
     [0, 1],
     [0, -1],
     [1, 0],
     [-1, 0],
]
Y = [4.8, 8.7, 11.2, 20.9, 7.3, 17.0, 7.4, 10.2, 3.4]
# задання функцій моделі регресії


def FunFi(x):
    Fi = [0]*k
    Fi[0] = 1
    Fi[1] = x[0]
    Fi[2] = x[1]
    Fi[3] = x[0] * x[1]
    Fi[4] = x[0] * x[0]
    Fi[5] = x[1] * x[1]
    return Fi

F = np.zeros((n, k))

for i in range(n):
    Fi = FunFi(X[i])
    for j in range(k):
        F[i,j] = Fi[j]

print(F)